Classes | Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::DuctElbowPreferenceTable Class Referencefinal
MEP Element Manager
The DuctElbowPreferenceTable contains cross section related information for Duct elbows. More...
#include <MEPDuctElbowPreferenceTable.hpp>
 Inheritance diagram for ACAPI::MEP::DuctElbowPreferenceTable:
 Classes
struct  | Key
The key that uniquely identifies a row in the DuctElbowPreferenceTable. More...
class  | Modifier
Modifier of the DuctElbowPreferenceTable. More...
 Public Member Functions
bool  | Exists () const
Result< void >  | IsEditable () const
Checks whether the table is editable.
GS::UniString  | GetName () const
uint32_t  | GetSize () const
Result< uint32_t >  | GetReferenceId (uint32_t index) const
Result< double >  | GetAngle (uint32_t index) const
Result< bool >  | IsRowValid (uint32_t index) const
A row is considered valid if its diameter and radius contains non-zero values, description is optional.
Result< bool >  | IsRowValidByKey (const Key &key) const
A row is considered valid if its diameter and radius contains non-zero values, description is optional.
Result< double >  | GetDiameter (uint32_t index) const
Result< double >  | GetDiameterByKey (const Key &key) const
Result< double >  | GetRadius (uint32_t index) const
Result< double >  | GetRadiusByKey (const Key &key) const
Result< GS::UniString >  | GetDescription (uint32_t index) const
Result< GS::UniString >  | GetDescriptionByKey (const Key &key) const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< DuctElbowPreferenceTable >  | Get (const UniqueID &uniqueId)
Returns a DuctElbowPreferenceTable.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The DuctElbowPreferenceTable contains cross section related information for Duct elbows.
Since
Archicad 28
The table uses the keys defined by the DuctReferenceSet and DuctAngleSet. To consider a table row usable and valid, it should have all its fields filled, beside its description, which is optional.
Example code snippet from Test / New MEP
Getters
 for (const UniqueID& ductElbowTableId : ductElbowTableIds) {
 ACAPI::Result<DuctElbowPreferenceTable> ductElbowTable = DuctElbowPreferenceTable::Get (ductElbowTableId);
 if (ductElbowTable.IsErr ())
 continue;
 preferenceReporter.SetTabCount (2);
 preferenceReporter.Add ("Preference name", ductElbowTable->GetName ());
 preferenceReporter.Add ("Circular table:");
 for (uint32_t i = 0; i < ductElbowTable->GetSize (); ++i) {
 preferenceReporter.SetTabCount (3);
 preferenceReporter.Add ("ReferenceId", *ductElbowTable->GetReferenceId (i), false);
 preferenceReporter.SetTabCount (0);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Angle", *ductElbowTable->GetAngle (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Diameter", *ductElbowTable->GetDiameter (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Radius", *ductElbowTable->GetRadius (i), false);
 preferenceReporter.Add (", ", false);
 GS::UniString description = *ductElbowTable->GetDescription (i);
 preferenceReporter.Add ("Description", description == GS::EmptyUniString ? "Empty" : description, false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add (*ductElbowTable->IsRowValid (i) ? "Row is valid" : "Row is not valid");
 }
 preferenceReporter.AddNewLine ();
 }
 Modification: take a look at DuctElbowPreferenceTable
Member Function Documentation
◆ Exists()
 bool ACAPI::MEP::DuctElbowPreferenceTable::Exists  |  ( |   | ) |   const
Returns
Checks if the object still exists.
◆ Get()
 static Result< DuctElbowPreferenceTable > ACAPI::MEP::DuctElbowPreferenceTable::Get  |  ( |  const UniqueID & |  uniqueId | )
static
Returns a DuctElbowPreferenceTable.
Parameters
uniqueId | The UniqueID of the requested DuctElbowPreferenceTable.
Returns
If the uniqueId belongs to a DuctElbowPreferenceTable, returns the object associated to it, otherwise Error.
◆ GetAngle()
 Result< double > ACAPI::MEP::DuctElbowPreferenceTable::GetAngle  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the angle of the table's row.
◆ GetDescription()
 Result< GS::UniString > ACAPI::MEP::DuctElbowPreferenceTable::GetDescription  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the description of the table's row.
◆ GetDescriptionByKey()
 Result< GS::UniString > ACAPI::MEP::DuctElbowPreferenceTable::GetDescriptionByKey  |  ( |  const Key & |  key | ) |   const
Parameters
key | The key that uniquely identifies a row in the DuctElbowPreferenceTable.
Returns
Returns error if a row for a given key does not occur in the table, otherwise returns the description of the table's row.
◆ GetDiameter()
 Result< double > ACAPI::MEP::DuctElbowPreferenceTable::GetDiameter  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetDiameterByKey()
 Result< double > ACAPI::MEP::DuctElbowPreferenceTable::GetDiameterByKey  |  ( |  const Key & |  key | ) |   const
Parameters
key | The key that uniquely identifies a row in the DuctElbowPreferenceTable.
Returns
Returns error if a row for a given key does not occur in the table, otherwise returns the diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetName()
 GS::UniString ACAPI::MEP::DuctElbowPreferenceTable::GetName  |  ( |   | ) |   const
Returns
Returns the name of the table.
◆ GetRadius()
 Result< double > ACAPI::MEP::DuctElbowPreferenceTable::GetRadius  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the radius value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetRadiusByKey()
 Result< double > ACAPI::MEP::DuctElbowPreferenceTable::GetRadiusByKey  |  ( |  const Key & |  key | ) |   const
Parameters
key | The key that uniquely identifies a row in the DuctElbowPreferenceTable.
Returns
Returns error if a row for a given key does not occur in the table, otherwise returns the radius value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetReferenceId()
 Result< uint32_t > ACAPI::MEP::DuctElbowPreferenceTable::GetReferenceId  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the referenceId of the table's row.
◆ GetSize()
 uint32_t ACAPI::MEP::DuctElbowPreferenceTable::GetSize  |  ( |   | ) |   const
Returns
Returns the size of table.
◆ IsEditable()
 Result< void > ACAPI::MEP::DuctElbowPreferenceTable::IsEditable  |  ( |   | ) |   const
Checks whether the table is editable.
Returns
Returns nothing if the table is editable, otherwise the error code and error message containing information about the reason.
◆ IsRowValid()
 Result< bool > ACAPI::MEP::DuctElbowPreferenceTable::IsRowValid  |  ( |  uint32_t |  index | ) |   const
A row is considered valid if its diameter and radius contains non-zero values, description is optional.
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the validity state of the row.
◆ IsRowValidByKey()
 Result< bool > ACAPI::MEP::DuctElbowPreferenceTable::IsRowValidByKey  |  ( |  const Key & |  key | ) |   const
A row is considered valid if its diameter and radius contains non-zero values, description is optional.
Parameters
key | The key that uniquely identifies a row in the DuctElbowPreferenceTable.
Returns
Returns error if the referenceId and angle is not in the DuctReferenceSet and DuctAngleSet, otherwise returns the validity state of the row.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::DuctElbowPreferenceTable::Modify  |  ( |  const ModifierFunc & |  modifierFunc,
|  const GS::UniString & |  undoString )
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.